In [42]:
import pandas as pd
import numpy as np
import seaborn as sns
import warnings 
import matplotlib.pyplot as plt
warnings.filterwarnings('ignore')

In [43]:
user_df=pd.read_csv('Users.csv')
books_df=pd.read_csv('Books.csv')
rating_df=pd.read_csv('Ratings.csv')

In [44]:
user_df.head(2)

   User-ID                   Location   Age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [45]:
user_df.shape

(278858, 3)

In [46]:
books_df.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [47]:
books_df.shape

(271360, 8)

In [48]:
rating_df.head(2)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5

In [49]:
rating_df.shape

(1149780, 3)

In [50]:
books_df.dropna(axis=0,inplace=True)
rating_df.dropna(axis=0,inplace=True)
user_df.dropna(axis=0,inplace=True)

In [51]:
new_rating_df=rating_df.merge(books_df,on='ISBN')

In [58]:
rating_count_df=new_rating_df.groupby('Book-Title')['Book-Rating'].count().reset_index()
rating_count_df.rename(columns={'Book-Rating':'count-rating'},inplace=True)
rating_count_df

                                               Book-Title  count-rating
0        A Light in the Storm: The Civil War Diary of ...             4
1                                   Always Have Popsicles             1
2                    Apple Magic (The Collector's series)             1
3        Ask Lily (Young Women of Faith: Lily Series, ...             1
4        Beyond IBM: Leadership Marketing and Finance ...             1
...                                                   ...           ...
241060                                      Ã?Â?lpiraten.             2
241061                     Ã?Â?rger mit Produkt X. Roman.             4
241062                                Ã?Â?sterlich leben.             1
241063                              Ã?Â?stlich der Berge.             3
241064                                  Ã?Â?thique en toc             2

[241065 rows x 2 columns]

In [59]:
rating_avg_df=new_rating_df.groupby('Book-Title')['Book-Rating'].mean().reset_index()
rating_avg_df.rename(columns={'Book-Rating':'avg-rating'},inplace=True)
rating_avg_df

                                               Book-Title  avg-rating
0        A Light in the Storm: The Civil War Diary of ...    2.250000
1                                   Always Have Popsicles    0.000000
2                    Apple Magic (The Collector's series)    0.000000
3        Ask Lily (Young Women of Faith: Lily Series, ...    8.000000
4        Beyond IBM: Leadership Marketing and Finance ...    0.000000
...                                                   ...         ...
241060                                      Ã?Â?lpiraten.    0.000000
241061                     Ã?Â?rger mit Produkt X. Roman.    5.250000
241062                                Ã?Â?sterlich leben.    7.000000
241063                              Ã?Â?stlich der Berge.    2.666667
241064                                  Ã?Â?thique en toc    4.000000

[241065 rows x 2 columns]

In [60]:
filter_rating_df=rating_count_df.merge(rating_avg_df,on='Book-Title')

In [67]:
top_rated_books_df=filter_rating_df[filter_rating_df['count-rating']>=250].sort_values(by='avg-rating',ascending=False)

In [69]:
top_rated_books_df.head()

,Book-Title,count-rating,avg-rating
80431,Harry Potter and the Prisoner of Azkaban (Book 3),428,5.852804
80419,Harry Potter and the Goblet of Fire (Book 4),387,5.824289
80438,Harry Potter and the Sorcerer's Stone (Book 1),278,5.737410
80423,Harry Potter and the Order of the Phoenix (Boo...,347,5.501441
80411,Harry Potter and the Chamber of Secrets (Book 2),556,5.183453

In [70]:
N = top_rated_books_df['count-rating'].mean()

In [75]:
M = 250

In [76]:
top_rated_books_df['Score'] = ((top_rated_books_df['avg-rating'] * top_rated_books_df['count-rating']) + (M * N)) / (top_rated_books_df['count-rating'] + N)

In [80]:
top_rated_books_df=top_rated_books_df.sort_values(by='Score',ascending=False)

In [81]:
top_rated_books_df.to_csv('top_rated_books_df.csv')